package com.dfbz.day22;

import sun.security.x509.IPAddressName;

public class Test1 {

         /*网络通讯的三要素是协议、IP地址、IP地址分类
         1.网络通信协议：通过计算机网络可以使多台计算机实现连接，位于同一个网络中的计算机在进行连接和通信时需要遵守一点的规则，
           这就好比在道路中行驶的汽车一样要遵守交通规则一样，在计算机网络中，这些连接和通信的规则被称为网络通信协议，它对数据的
           传输格式、传输速率、传输步骤等做了统一规定，通信双方必须同时遵守才能完成数据交换。
         2.IP地址：指互联网协议地址，俗称IP。IP地址用来给一个网络中的计算机设备做唯一的编号。假如我们把个人电脑比作一台电话的话，那么IP地址就相当于电话号码。
         3.IP地址分类：
              IPv4：是一个32位的二进制数，通常被分为4个字节，表示abcd的形式，例如192.168.65.100.其中abcd都是0-255之间的十进制整数，那么最多可以表示42亿个。
              IPv6：由于互联网的蓬勃发展，IP地址的需求愈来愈大，但是网络地址资源有限，使得IP的分配越发紧张，为了扩大地址空间，
              拟通过IPv6重新定义地址空间，采用128位地址长度，每16个字节一组，分成8组十六进制数，表示成ABCD：EF01:2345:6789:ABCD:EF01:2345:6789，
              号称可以为全世界的每一粒沙子编上一个网址，这样就解决了网络地址资源数量不够的问题。*/


}
